# ContinuousFootingDefaultEndExtensionLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ContinuousFootingDefaultEndExtensionLength Property
ParameterTypeId Class See Also
---
"Default End Extension Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ContinuousFootingDefaultEndExtensionLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousFootingDefaultEndExtensionLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ContinuousFootingDefaultEndExtensionLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace